{
  "_name_or_path": "SCUT-DLVCLab/lilt-roberta-en-base",
  "architectures": [
    "LiltForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "channel_shrink_ratio": 4,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "I-Q",
    "1": "E-TABLE",
    "2": "E-SUBJECT NAME",
    "3": "E-SUB-SUB-Q",
    "4": "I-CHART",
    "5": "B-CHART",
    "6": "I-TABLE",
    "7": "B-Q",
    "8": "E-Q",
    "9": "B-TABLE",
    "10": "O",
    "11": "B-SUB-SUB-Q",
    "12": "S-CHART",
    "13": "B-SUBJECT NAME",
    "14": "B-SUB-Q",
    "15": "E-SUB-Q",
    "16": "E-CHART",
    "17": "I-SUB-SUB-Q",
    "18": "I-SUB-Q"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CHART": 5,
    "B-Q": 7,
    "B-SUB-Q": 14,
    "B-SUB-SUB-Q": 11,
    "B-SUBJECT NAME": 13,
    "B-TABLE": 9,
    "E-CHART": 16,
    "E-Q": 8,
    "E-SUB-Q": 15,
    "E-SUB-SUB-Q": 3,
    "E-SUBJECT NAME": 2,
    "E-TABLE": 1,
    "I-CHART": 4,
    "I-Q": 0,
    "I-SUB-Q": 18,
    "I-SUB-SUB-Q": 17,
    "I-TABLE": 6,
    "O": 10,
    "S-CHART": 12
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "model_type": "lilt",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
